<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a060c5a2a149fe6a0c0c5938abaec1ef60fb5d0cdfa58757421b214087470eef","plan_job_ref":"Job Staging Image Build & Push #14 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7347950058","plan_hash":"aad06089bb3fbfc6f2a74fadb9be0f8ab4f93bf84dea55e2f7f5ec7a377eddd5","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 3 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.cert will be created
+   resource "aws_acm_certificate" "cert" {
+       arn                       = (known after apply)
+       domain_name               = "test.fastapi.dennisowie.com"
+       domain_validation_options = (known after apply)
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "test.fastapi.dennisowie.com",
        ]
+       tags_all                  = {
+           "Environment" = "Dev Environment"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "EMAIL"
    }

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:14" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:14" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:b2434490dfff76442a3397ec150857d60b267195" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:04776b2554062d69c0864bc4c451aeb93043023e"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
!~      revision                 = 14 -> (known after apply)
-       tags                     = {} -> null
#        (7 unchanged attributes hidden)
    }

  # aws_lb_listener.listerner_443 will be created
+   resource "aws_lb_listener" "listerner_443" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:us-east-1:806066816337:certificate/3848def8-0982-4f7e-b2be-664c6d00d101"
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0"
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-2016-08"
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev-443/4c3e823ca057454b"
+           type             = "forward"
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #14](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7347950058)